; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v8 ?v2)
             (pred_4 ?v1 ?v9)
             (pred_1 ?v8 ?v9)
             (pred_7 ?v11 ?v8 )
	     (pred_5 ?v8)
             (pred_8 ?v5)
             (pred_11 ?v1)
             (pred_2 ?v9)
             (pred_6 ?v8)
             (pred_10 ?v1)
             (pred_3 ?v8)
             (pred_12 ))



(:action op_2
:parameters (?v10 ?v3 ?v6 ?v13)
:precondition (and (pred_8 ?v10) (pred_8 ?v3) (pred_11 ?v6) (pred_2 ?v13)
          (pred_9 ?v10 ?v3) (pred_4 ?v6 ?v13)
                   (pred_1 ?v3 ?v13) (pred_5 ?v10) 
                   (pred_6 ?v3) (pred_10 ?v6))
:effect (and  (pred_3 ?v3) (not (pred_6 ?v3))))


(:action op_4
:parameters (?v10 ?v4)
:precondition (and (pred_8 ?v10) (pred_8 ?v4)
               (pred_5 ?v10) (pred_9 ?v10 ?v4) (pred_3 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_8 ?v10) (pred_11 ?v6) 
                  (pred_5 ?v10) (pred_7 ?v6 ?v10) (pred_12 ))
:effect (and (pred_10 ?v6)
   (not (pred_7 ?v6 ?v10)) (not (pred_12 ))))


(:action op_5
:parameters (?v10 ?v12 ?v7)
:precondition (and (pred_8 ?v10) (pred_11 ?v12) (pred_11 ?v7)
                  (pred_5 ?v10) (pred_10 ?v7) (pred_7 ?v12 ?v10))
:effect (and (pred_10 ?v12) (pred_7 ?v7 ?v10)
        (not (pred_10 ?v7)) (not (pred_7 ?v12 ?v10))))

(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_8 ?v10) (pred_11 ?v6) 
                  (pred_5 ?v10) (pred_10 ?v6))
:effect (and (pred_12 ) (pred_7 ?v6 ?v10) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_10 obj_18 obj_16 obj_25 obj_26 obj_07 obj_30 obj_08 obj_23 obj_28 obj_31 obj_14 obj_11 obj_27 obj_29 obj_01 obj_09 obj_24 obj_15 obj_19 obj_17 obj_02 obj_20 obj_03
    obj_22 obj_21 obj_04
    obj_13 obj_05 obj_12
    )

    (:init
       (pred_12)

       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_25)
       (pred_8 obj_26)
       (pred_8 obj_07)
       (pred_8 obj_30)
       (pred_8 obj_08)
       (pred_8 obj_23)
       (pred_8 obj_28)
       (pred_8 obj_31)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_27)
       (pred_8 obj_29)
       (pred_8 obj_01)
       (pred_8 obj_09)
       (pred_8 obj_24)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_20)
       (pred_8 obj_03)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_04)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_12)

       (pred_9 obj_06 obj_26)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_18 obj_30)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_16 obj_25)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_25 obj_23)
       (pred_9 obj_25 obj_16)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_26 obj_07)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_07 obj_31)
       (pred_9 obj_07 obj_30)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_26)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_08)
       (pred_9 obj_30 obj_18)
       (pred_9 obj_30 obj_07)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_08 obj_23)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_08 obj_30)
       (pred_9 obj_23 obj_27)
       (pred_9 obj_23 obj_25)
       (pred_9 obj_23 obj_08)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_28 obj_31)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_31 obj_01)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_31 obj_07)
       (pred_9 obj_31 obj_28)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_11 obj_24)
       (pred_9 obj_11 obj_27)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_27 obj_23)
       (pred_9 obj_27 obj_11)
       (pred_9 obj_29 obj_19)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_01 obj_09)
       (pred_9 obj_01 obj_31)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_09 obj_24)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_09 obj_01)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_15)
       (pred_9 obj_24 obj_11)
       (pred_9 obj_24 obj_09)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_24)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_29)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_20)
       (pred_6 obj_17)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_1  obj_17 obj_22)
       (pred_1  obj_20 obj_21)
       (pred_1  obj_02 obj_04)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_16)
       (pred_3 obj_25)
       (pred_3 obj_26)
       (pred_3 obj_07)
       (pred_3 obj_30)
       (pred_3 obj_08)
       (pred_3 obj_23)
       (pred_3 obj_28)
       (pred_3 obj_31)
       (pred_3 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_27)
       (pred_3 obj_29)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_24)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_03)

       (pred_4  obj_13 obj_22)
       (pred_4  obj_05 obj_21)
       (pred_4  obj_12 obj_04)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_05 obj_25)
       (pred_7 obj_12 obj_19)
       (pred_5 obj_18)
    )

    (:goal (and
       (pred_7 obj_05 obj_29)
    ))
(:constraints
  (always (not (pred_5 obj_16)))
)
)

; plan
1. (op_4 obj_18 obj_30)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_30)
   goals met: 0 of 1
2. (op_4 obj_30 obj_08)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_23)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_23)
   goals met: 0 of 1
4. (op_4 obj_23 obj_25)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_25)
   goals met: 0 of 1
5. (op_1 obj_25 obj_05)
   deleted: (pred_7 obj_05 obj_25) (pred_12)
   added: (pred_10 obj_05)
   goals met: 0 of 1
6. (op_4 obj_25 obj_23)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_23)
   goals met: 0 of 1
7. (op_4 obj_23 obj_08)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_08)
   goals met: 0 of 1
8. (op_4 obj_08 obj_30)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_30)
   goals met: 0 of 1
9. (op_4 obj_30 obj_07)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_07)
   goals met: 0 of 1
10. (op_4 obj_07 obj_26)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_26)
   goals met: 0 of 1
11. (op_4 obj_26 obj_28)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_28)
   goals met: 0 of 1
12. (op_4 obj_28 obj_29)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_29)
   goals met: 0 of 1
13. (op_3 obj_29 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_12) (pred_7 obj_05 obj_29)
   goals met: 1 of 1
